In [26]:
import pandas as pd

In [27]:
friend = list()
line = {'name':'John','age':15,'job':'student'}
friend.append(line)
line = {'name':'Jenny','age':30,'job':'developer'}
friend.append(line)
line = {'name':'Nate','age':30,'job':'teacher'}
friend.append(line)
df = pd.DataFrame(friend, columns=['name','age','job'])

In [28]:
df

    name  age        job
0   John   15    student
1  Jenny   30  developer
2   Nate   30    teacher

### Add row

In [29]:
# df1 = pd.DataFrame([['Ben',40,'engineer']], columns=['name','age','job'])
# df.append(df1,ignore_index=True) 
dict1 = {'name':'Ben','age':40,'job':'engineer'}
df1 = df.append(dict1,ignore_index=True)
df1

C:\Users\snk\AppData\Local\Temp\ipykernel_21120\866265084.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df.append(dict1,ignore_index=True)

    name  age        job
0   John   15    student
1  Jenny   30  developer
2   Nate   30    teacher
3    Ben   40   engineer

### Add bottom Row

In [36]:
df1.loc[df1.shape[0]]=['Ben1',45,'engineer']
df1

     name  age        job
0    Ben2   45   engineer
1    Ben2   45   engineer
2    Ben2   45   engineer
3    Ben2   45   engineer
4    John   15    student
5   Jenny   30  developer
6    Nate   30    teacher
7     Ben   40   engineer
8    Ben1   45   engineer
9    Ben1   45   engineer
10   Ben1   45   engineer

### last item

In [40]:
print(df1.iloc[-1]['name'])

print(list(df1.iloc[-1]))

Ben1
['Ben1', 45, 'engineer']

### Add Top row

In [34]:
df1.loc[-1]=['Ben2',45,'engineer']
df1.index = df1.index + 1
df1 = df1.sort_index()
df1.tail(1)

   name  age       job
8  Ben1   45  engineer

In [ ]:
list(df1.columns)

In [10]:
df_rows = df1.to_numpy().tolist()
df_rows

[['John', 15, 'student'],
 ['Jenny', 30, 'developer'],
 ['Nate', 30, 'teacher'],
 ['Ben', 40, 'engineer'],
 ['Ben1', 45, 'engineer'],
 ['Ben1', 45, 'engineer'],
 ['Ben1', 45, 'engineer']]

### 기존 dataframe에 list 추가 하기

In [25]:
addlist = ['jsyoon',58]
df2 = pd.DataFrame([addlist], columns=['name','age'])
df1= df1.append(df2, ignore_index=True)
df1

C:\Users\snk\AppData\Local\Temp\ipykernel_21120\3442644327.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1= df1.append(df2, ignore_index=True)

     name  age        job
0    John   15    student
1   Jenny   30  developer
2    Nate   30    teacher
3     Ben   40   engineer
4    Ben1   45   engineer
5    Ben1   45   engineer
6    Ben1   45   engineer
7  jsyoon   58        NaN